# Оригінальний текст
text = "Робота в ІТ передбачає постійне навчання та розвиток. Спеціалісти повинні\
 володіти технічними знаннями, вирішувати проблеми та ефективно співпрацювати в\
 командах для досягнення успіху в проєктах."

# (Стешенко Станіслав КН-31.1)
# 1. Використання функції lower() для переведення всіх символів у нижній регістр
lowercase_text = text.lower()
print("Текст у нижньому регістрі:")
print(lowercase_text, "\n")

# 2. Використання функції count() для підрахунку кількості входжень слова "та"
count_of_word_ta = text.count("та")
print("Кількість входжень слова 'та':", count_of_word_ta, "\n")

# 3. Використання функції replace() для заміни слова "співпрацювати" на "взаємодіяти"
replaced_text = text.replace("співпрацювати", "взаємодіяти")
print("Текст після заміни слова 'співпрацювати':")
print(replaced_text)

# (Мороз Володимир КН-31.1)
# 1. Використання функції split() для розбиву тексту на окремі речення
split = text.split('. ')
print('Текст по реченням:')
for i in split:
    print(i)

# 2. Переведення рядку у верхній регістр
big = text.upper()
print('Текст капсом:')
print(big)

# 3. Зміна регістру кожного символа на протилежний
swap = text.swapcase()
print('"Обернений" текст:')
print(swap)

# Іванченко Олександр КН-33.2
# 1 Функція capitalize() передбачає виведення на екран тексту де перше слово з великої ліери, а всі інші з малої
capitalized_text = text.capitalize()
print("Переформатований текст:", capitalized_text)

# 2 Функція isdigit() передбачає перевірку на наявність цифр у тексті
if text.isdigit():
    print("\n Текст складається лише з цифр.")
else:
    print("\nТекст містить не тільки цифри.")
    
# 3 Функція partition() ділить рядок на три частини, до першого входження підрядка,сам підрядок і все після нього
partitioned_text = text.partition("навчання")
print("\nТекст розбитий на три частини:", partitioned_text)


# Шелест Ігор КН-33.2
# 1. Використання функції len() для підрахунку кількості символів у тексті
length_of_text = len(text)
print("Кількість символів у тексті:", length_of_text)

# 2. Використання функції startswith() для перевірки, чи починається текст зі слова "Робота"
starts_with_robota = text.startswith("Робота")
print("\nЧи починається текст зі слова 'Робота':", starts_with_robota)

# 3. Використання функції endswith() для перевірки, чи закінчується текст на слово "проєктах."
ends_with_projektah = text.endswith("проєктах.")
print("\nЧи закінчується текст на слово 'проєктах.':", ends_with_projektah)
